RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_i2c.c
/**
 **************************************************************************
 * File Name    : at32f4xx_i2c.c
 * Description  : at32f4xx I2C source file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_i2c.h"
#include "at32f4xx_rcc.h"


/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup I2C
  * @brief I2C driver modules
  * @{
  */

/** @defgroup I2C_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_Defines
  * @{
  */

/* I2C SPE mask */
#define CTRL1_PEN_Set               ((uint16_t)0x0001)
#define CTRL1_PEN_Reset             ((uint16_t)0xFFFE)

/* I2C START mask */
#define CTRL1_STARTGEN_Set          ((uint16_t)0x0100)
#define CTRL1_STARTGEN_Reset        ((uint16_t)0xFEFF)

/* I2C STOP mask */
#define CTRL1_STOPGEN_Set           ((uint16_t)0x0200)
#define CTRL1_STOPGEN_Reset         ((uint16_t)0xFDFF)

/* I2C ACK mask */
#define CTRL1_ACKEN_Set             ((uint16_t)0x0400)
#define CTRL1_ACKEN_Reset           ((uint16_t)0xFBFF)

/* I2C ENGC mask */
#define CTRL1_GCEN_Set              ((uint16_t)0x0040)
#define CTRL1_GCEN_Reset            ((uint16_t)0xFFBF)

/* I2C SWRST mask */
#define CTRL1_SWRESET_Set           ((uint16_t)0x8000)
#define CTRL1_SWRESET_Reset         ((uint16_t)0x7FFF)

/* I2C PEC mask */
#define CTRL1_PECTRA_Set            ((uint16_t)0x1000)
#define CTRL1_PECTRA_Reset          ((uint16_t)0xEFFF)

/* I2C ENPEC mask */
#define CTRL1_PECEN_Set             ((uint16_t)0x0020)
#define CTRL1_PECEN_Reset           ((uint16_t)0xFFDF)

/* I2C ENARP mask */
#define CTRL1_ARPEN_Set             ((uint16_t)0x0010)
#define CTRL1_ARPEN_Reset           ((uint16_t)0xFFEF)

/* I2C NOSTRETCH mask */
#define CTRL1_NOCLKSTRETCH_Set      ((uint16_t)0x0080)
#define CTRL1_NOCLKSTRETCH_Reset    ((uint16_t)0xFF7F)

/* I2C registers Masks */
#define CTRL1_CLEAR_MASK            ((uint16_t)0xFBF5)

/* I2C DMAEN mask */
#define CTRL2_DMAEN_Set             ((uint16_t)0x0800)
#define CTRL2_DMAEN_Reset           ((uint16_t)0xF7FF)

/* I2C LAST mask */
#define CTRL2_DMALAST_Set           ((uint16_t)0x1000)
#define CTRL2_DMALAST_Reset         ((uint16_t)0xEFFF)

/* I2C FREQ mask */
#define CTRL2_CLKFREQ_Reset         ((uint16_t)0xFF00)

/* I2C ADD0 mask */
#define OADDR1_ADDR0_Set            ((uint16_t)0x0001)
#define OADDR1_ADDR0_Reset          ((uint16_t)0xFFFE)

/* I2C ENDUAL mask */
#define OADDR2_DUALEN_Set           ((uint16_t)0x0001)
#define OADDR2_DUALEN_Reset         ((uint16_t)0xFFFE)

/* I2C ADD2 mask */
#define OADDR2_ADDR2_Reset          ((uint16_t)0xFF01)

/* I2C F/S mask */
#define CLKCTRL_FSMODE_Set          ((uint16_t)0x8000)

/* I2C CCR mask */
#define CLKCTRL_CLKCTRL_Set         ((uint16_t)0x0FFF)

/* I2C FLAG mask */
#define FLAG_Mask                   ((uint32_t)0x00FFFFFF)

/* I2C Interrupt Enable mask */
#define INTEN_Mask                  ((uint32_t)0x07000000)

/**
  * @}
  */

/** @defgroup I2C_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the I2Cx peripheral registers to their default reset values.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @retval None
  */
void I2C_DeInit(I2C_Type* I2Cx)
{
  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));

  if (I2Cx == I2C1)
  {
    /* Enable I2C1 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_I2C1, ENABLE);
    /* Release I2C1 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_I2C1, DISABLE);
  }
  else if (I2Cx == I2C2)
  {
    /* Enable I2C2 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_I2C2, ENABLE);
    /* Release I2C2 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_I2C2, DISABLE);
  }
#ifdef AT32F403xx
  else if (I2Cx == I2C3)
  {
    /* Enable I2C3 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_I2C3, ENABLE);
    /* Release I2C3 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_I2C3, DISABLE);
  }
#endif
}

/**
  * @brief  Initializes the I2Cx peripheral according to the specified
  *   parameters in the I2C_InitStruct.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @param  I2C_InitStruct: pointer to a I2C_InitType structure that
  *   contains the configuration information for the specified I2C peripheral.
  * @retval None
  */
void I2C_Init(I2C_Type* I2Cx, I2C_InitType* I2C_InitStruct)
{
  uint16_t tmpreg = 0, freqrange = 0;
  uint16_t result = 0x04;
  uint32_t pclk1 = 8000000;
  RCC_ClockType  rcc_clocks;
  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_I2C_BIT_RATE(I2C_InitStruct->I2C_BitRate));
  assert_param(IS_I2C_MODE(I2C_InitStruct->I2C_Mode));
  assert_param(IS_I2C_FM_DUTY_CYCLE(I2C_InitStruct->I2C_FmDutyCycle));
  assert_param(IS_I2C_OWN_ADDRESS1(I2C_InitStruct->I2C_OwnAddr1));
  assert_param(IS_I2C_ACK_STATE(I2C_InitStruct->I2C_Ack));
  assert_param(IS_I2C_ADDR_MODE(I2C_InitStruct->I2C_AddrMode));

  /*---------------------------- I2Cx CTRL2 Configuration ------------------------*/
  /* Get the I2Cx CTRL2 value */
  tmpreg = I2Cx->CTRL2;
  /* Clear frequency FREQ[7:0] bits */
  tmpreg &= CTRL2_CLKFREQ_Reset;
  /* Get pclk1 frequency value */
  RCC_GetClocksFreq(&rcc_clocks);
  pclk1 = rcc_clocks.APB1CLK_Freq;
  /* Set frequency bits depending on pclk1 value */
  freqrange = (uint16_t)(pclk1 / 1000000);
  tmpreg |= freqrange;
  /* Write to I2Cx CTRL2 */
  I2Cx->CTRL2 = tmpreg;

  /*---------------------------- I2Cx CCR Configuration ------------------------*/
  /* Disable the selected I2C peripheral to configure TRISE */
  I2Cx->CTRL1 &= CTRL1_PEN_Reset;
  /* Reset tmpreg value */
  /* Clear F/S, DUTY and CCR[11:0] bits */
  tmpreg = 0;

  /* Configure speed in standard mode */
  if (I2C_InitStruct->I2C_BitRate <= 100000)
  {
    /* Standard mode speed calculate */
    result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_BitRate << 1));

    /* Test if CCR value is under 0x4*/
    if (result < 0x04)
    {
      /* Set minimum allowed value */
      result = 0x04;
    }

    /* Set speed value for standard mode */
    tmpreg |= result;
    /* Set Maximum Rise Time for standard mode */
    I2Cx->TMRISE = freqrange + 1;
  }
  /* Configure speed in fast mode */
  else /*(I2C_InitStruct->I2C_ClockSpeed <= 400000)*/
  {
    if (I2C_InitStruct->I2C_FmDutyCycle == I2C_FmDutyCycle_2_1)
    {
      /* Fast mode speed calculate: Tlow/Thigh = 2 */
      result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_BitRate * 3));
    }
    else /*I2C_InitStruct->I2C_DutyCycle == I2C_FmDutyCycle_16_9*/
    {
      /* Fast mode speed calculate: Tlow/Thigh = 16/9 */
      result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_BitRate * 25));
      /* Set DUTY bit */
      result |= I2C_FmDutyCycle_16_9;
    }

