RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_i2c.c
  /* Read the I2Cx status register */
  flag1 = I2Cx->STS1;
  flag2 = I2Cx->STS2;
  flag2 = flag2 << 16;

  /* Get the last event value from I2C status register */
  lastevent = (flag1 | flag2) & FLAG_Mask;

  /* Check whether the last event contains the I2C_EVENT */
  if ((lastevent & I2C_EVENT) == I2C_EVENT)
  {
    /* SUCCESS: last event is equal to I2C_EVENT */
    status = SUCCESS;
  }
  else
  {
    /* ERROR: last event is different from I2C_EVENT */
    status = ERROR;
  }

  /* Return status */
  return status;
}

/**
  * @brief  Returns the last I2Cx Event.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  *
  * @note: For detailed description of Events, please refer to section
  *    I2C_Events in at32f4xx_i2c.h file.
  *
  * @retval The last event
  */
uint32_t I2C_GetLastEvent(I2C_Type* I2Cx)
{
  uint32_t lastevent = 0;
  uint32_t flag1 = 0, flag2 = 0;

  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));

  /* Read the I2Cx status register */
  flag1 = I2Cx->STS1;
  flag2 = I2Cx->STS2;
  flag2 = flag2 << 16;

  /* Get the last event value from I2C status register */
  lastevent = (flag1 | flag2) & FLAG_Mask;

  /* Return status */
  return lastevent;
}

/**
  * @brief  Checks whether the specified I2C flag is set or not.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @param  I2C_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg I2C_FLAG_DUALF: Dual flag (Slave mode)
  *     @arg I2C_FLAG_SMBHOSTADDRF: SMBus host header (Slave mode)
  *     @arg I2C_FLAG_SMBDEFTADDRF: SMBus default header (Slave mode)
  *     @arg I2C_FLAG_GCADDRF: General call header flag (Slave mode)
  *     @arg I2C_FLAG_TRF: Transmitter/Receiver flag
  *     @arg I2C_FLAG_BUSYF: Bus busy flag
  *     @arg I2C_FLAG_MSF: Master/Slave flag
  *     @arg I2C_FLAG_SMBALERTF: SMBus Alert flag
  *     @arg I2C_FLAG_TIMOUT: Timeout or Tlow error flag
  *     @arg I2C_FLAG_PECERR: PEC error in reception flag
  *     @arg I2C_FLAG_OVRUN: Overrun/Underrun flag (Slave mode)
  *     @arg I2C_FLAG_ACKFAIL: Acknowledge failure flag
  *     @arg I2C_FLAG_ARLOST: Arbitration lost flag (Master mode)
  *     @arg I2C_FLAG_BUSERR: Bus error flag
  *     @arg I2C_FLAG_TDE: Data register empty flag (Transmitter)
  *     @arg I2C_FLAG_RDNE: Data register not empty (Receiver) flag
  *     @arg I2C_FLAG_STOPF: Stop detection flag (Slave mode)
  *     @arg I2C_FLAG_ADDR10F: 10-bit header sent flag (Master mode)
  *     @arg I2C_FLAG_BTFF: Byte transfer finished flag
  *     @arg I2C_FLAG_ADDRF: Address sent flag (Master mode) "ADSL"
  *   Address matched flag (Slave mode)"ENDA"
  *     @arg I2C_FLAG_STARTF: Start bit flag (Master mode)
  * @retval The new state of I2C_FLAG (SET or RESET).
  */
FlagStatus I2C_GetFlagStatus(I2C_Type* I2Cx, uint32_t I2C_FLAG)
{
  FlagStatus bitstatus = RESET;
  __IO uint32_t i2creg = 0, i2cxbase = 0;

  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_I2C_GET_FLAG(I2C_FLAG));

  /* Get the I2Cx peripheral base address */
  i2cxbase = (uint32_t)I2Cx;

  /* Read flag register index */
  i2creg = I2C_FLAG >> 28;

  /* Get bit[23:0] of the flag */
  I2C_FLAG &= FLAG_Mask;

  if(i2creg != 0)
  {
    /* Get the I2Cx SR1 register address */
    i2cxbase += 0x14;
  }
  else
  {
    /* Flag in I2Cx SR2 Register */
    I2C_FLAG = (uint32_t)(I2C_FLAG >> 16);
    /* Get the I2Cx SR2 register address */
    i2cxbase += 0x18;
  }

  if(((*(__IO uint32_t *)i2cxbase) & I2C_FLAG) != (uint32_t)RESET)
  {
    /* I2C_FLAG is set */
    bitstatus = SET;
  }
  else
  {
    /* I2C_FLAG is reset */
    bitstatus = RESET;
  }

  /* Return the I2C_FLAG status */
  return  bitstatus;
}



/**
  * @brief  Clears the I2Cx's pending flags.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @param  I2C_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg I2C_FLAG_SMBALERTF: SMBus Alert flag
  *     @arg I2C_FLAG_TIMOUT: Timeout or Tlow error flag
  *     @arg I2C_FLAG_PECERR: PEC error in reception flag
  *     @arg I2C_FLAG_OVRUN: Overrun/Underrun flag (Slave mode)
  *     @arg I2C_FLAG_ACKFAIL: Acknowledge failure flag
  *     @arg I2C_FLAG_ARLOST: Arbitration lost flag (Master mode)
  *     @arg I2C_FLAG_BUSERR: Bus error flag
  *
  * @note
  *   - STOPF (STOP detection) is cleared by software sequence: a read operation
  *     to I2C_SR1 register (I2C_GetFlagStatus()) followed by a write operation
  *     to I2C_CTRL1 register (I2C_Cmd() to re-enable the I2C peripheral).
  *   - ADD10 (10-bit header sent) is cleared by software sequence: a read
  *     operation to I2C_SR1 (I2C_GetFlagStatus()) followed by writing the
  *     second byte of the address in DR register.
  *   - BTF (Byte Transfer Finished) is cleared by software sequence: a read
  *     operation to I2C_SR1 register (I2C_GetFlagStatus()) followed by a
  *     read/write to I2C_DR register (I2C_SendData()).
  *   - ADDR (Address sent) is cleared by software sequence: a read operation to
  *     I2C_SR1 register (I2C_GetFlagStatus()) followed by a read operation to
  *     I2C_SR2 register ((void)(I2Cx->SR2)).
  *   - SB (Start Bit) is cleared software sequence: a read operation to I2C_SR1
  *     register (I2C_GetFlagStatus()) followed by a write operation to I2C_DR
  *     register  (I2C_SendData()).
  * @retval None
  */
void I2C_ClearFlag(I2C_Type* I2Cx, uint32_t I2C_FLAG)
{
  uint32_t flagpos = 0;
  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_I2C_CLEAR_FLAG(I2C_FLAG));
  /* Get the I2C flag position */
  flagpos = I2C_FLAG & FLAG_Mask;
  /* Clear the selected I2C flag */
  I2Cx->STS1 = (uint16_t)~flagpos;
}

/**
  * @brief  Checks whether the specified I2C interrupt has occurred or not.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @param  I2C_INT: specifies the interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg I2C_INT_SMBALERTF: SMBus Alert flag
  *     @arg I2C_INT_TIMOUT: Timeout or Tlow error flag
  *     @arg I2C_INT_PECERR: PEC error in reception flag
  *     @arg I2C_INT_OVRUN: Overrun/Underrun flag (Slave mode)
  *     @arg I2C_INT_ACKFAIL: Acknowledge failure flag
  *     @arg I2C_INT_ARLOST: Arbitration lost flag (Master mode)
  *     @arg I2C_INT_BUSERR: Bus error flag
  *     @arg I2C_INT_TDE: Data register empty flag (Transmitter)
  *     @arg I2C_INT_RDNE: Data register not empty (Receiver) flag
  *     @arg I2C_INT_STOPF: Stop detection flag (Slave mode)
  *     @arg I2C_INT_ADDR10F: 10-bit header sent flag (Master mode)
  *     @arg I2C_INT_BTFF: Byte transfer finished flag
  *     @arg I2C_INT_ADDRF: Address sent flag (Master mode) "ADSL"
  *                       Address matched flag (Slave mode)"ENDAD"
  *     @arg I2C_INT_STARTF: Start bit flag (Master mode)
  * @retval The new state of I2C_INT (SET or RESET).
  */
ITStatus I2C_GetINTStatus(I2C_Type* I2Cx, uint32_t I2C_INT)
{
  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;

  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_I2C_GET_INT(I2C_INT));

  /* Check if the interrupt source is enabled or not */
  enablestatus = (uint32_t)(((I2C_INT & INTEN_Mask) >> 16) & (I2Cx->CTRL2)) ;

  /* Get bit[23:0] of the flag */
  I2C_INT &= FLAG_Mask;

  /* Check the status of the specified I2C flag */
  if (((I2Cx->STS1 & I2C_INT) != (uint32_t)RESET) && enablestatus)
  {
    /* I2C_INT is set */
    bitstatus = SET;
  }
  else
  {
    /* I2C_INT is reset */
    bitstatus = RESET;
  }

  /* Return the I2C_INT status */
  return  bitstatus;
}

/**
  * @brief  Clears the I2Cx interrupt pending bits.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @param  I2C_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg I2C_INT_SMBALERTF: SMBus Alert interrupt
  *     @arg I2C_INT_TIMOUT: Timeout or Tlow error interrupt
  *     @arg I2C_INT_PECERR: PEC error in reception  interrupt
  *     @arg I2C_INT_OVRUN: Overrun/Underrun interrupt (Slave mode)
  *     @arg I2C_INT_ACKFAIL: Acknowledge failure interrupt
  *     @arg I2C_INT_ARLOST: Arbitration lost interrupt (Master mode)
  *     @arg I2C_INT_BUSERR: Bus error interrupt
  *
  * @note
  *   - STOPF (STOP detection) is cleared by software sequence: a read operation
  *     to I2C_SR1 register (I2C_GetINTStatus()) followed by a write operation to
  *     I2C_CTRL1 register (I2C_Cmd() to re-enable the I2C peripheral).
  *   - ADD10 (10-bit header sent) is cleared by software sequence: a read
  *     operation to I2C_SR1 (I2C_GetINTStatus()) followed by writing the second
  *     byte of the address in I2C_DR register.
  *   - BTF (Byte Transfer Finished) is cleared by software sequence: a read
  *     operation to I2C_SR1 register (I2C_GetINTStatus()) followed by a
  *     read/write to I2C_DR register (I2C_SendData()).
  *   - ADDR (Address sent) is cleared by software sequence: a read operation to
  *     I2C_SR1 register (I2C_GetINTStatus()) followed by a read operation to
  *     I2C_SR2 register ((void)(I2Cx->SR2)).
  *   - SB (Start Bit) is cleared by software sequence: a read operation to
  *     I2C_SR1 register (I2C_GetINTStatus()) followed by a write operation to
  *     I2C_DR register (I2C_SendData()).
  * @retval None
  */
void I2C_ClearITPendingBit(I2C_Type* I2Cx, uint32_t I2C_INT)
{
  uint32_t flagpos = 0;
  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_I2C_CLEAR_INT(I2C_INT));
  /* Get the I2C flag position */
  flagpos = I2C_INT & FLAG_Mask;
  /* Clear the selected I2C flag */
  I2Cx->STS1 = (uint16_t)~flagpos;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


